12/data/attachments/b79ced264ed46565.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fdf39a80-fddd-4299-b9d4-02777f16295a</nif:username>
            <nif:friendToBeAdded>Kelly_suffer_Friend_26104_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>